АлогистикТест2/src/Documents/алк_ВводПроизводственныхПоказателейДГ/алк_ВводПроизводственныхПоказателейДГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВводПроизводственныхПоказателейДГ</name>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОперативныеПоказателиПроизводства</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.алк_ПоказателиПроизводстваДГ</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоказателиОперсводки</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.алк_ПоказателиПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ОборотыПроизводства/алк_ОборотыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОборотыПроизводства</name>
  <comment>старый !</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтгрузки</name>
    <type>
      <types>EnumRef.алк_ВидыОтгрузки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответхранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнутреннееПотребление</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_ВидЗначенияПоказателяОтчетов/алк_ВидЗначенияПоказателяОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидЗначенияПоказателяОтчетов</name>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Бюджет</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ПоказателиПроизводства/алк_ПоказателиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ПоказателиПроизводства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>алк_ОперацияПроизводства</name>
    <type>
      <types>EnumRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНоменклатура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПорода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВидОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтветхранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНесортированная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВлажность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСушильныеКамеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОрганизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьХарактеристика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьЗначенияВОтчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделитьЦветомВОтчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВОтчете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогиПоСреднему</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сорта</name>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Породы</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Влажности</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>CatalogRef.Влажность</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыОтгрузки</name>
    <attributes>
      <name>ВидОтгрузки</name>
      <type>
        <types>EnumRef.алк_ВидыОтгрузки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ВводПроизводственныхПоказателейДГ/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре"; 
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	ОборотыПроизводства = Движения.алк_ОборотыПроизводства;
	ОборотыПроизводства.Записывать = Истина;
	Запрос = новый запрос(
	"ВЫБРАТЬ
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Значение КАК Объем,
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Ссылка.Направление,
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Показатель,
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Ссылка.ДатаСмены КАК Дата,
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Ссылка.Организация
	|ПОМЕСТИТЬ ВТ_ПоказателиДокумента
	|ИЗ
	|	Документ.алк_ВводПроизводственныхПоказателейДГ.ПоказателиОперсводки КАК алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки
	|ГДЕ
	|	алк_ВводПроизводственныхПоказателейДГПоказателиОперсводки.Ссылка = &ВводПоказателей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоказателиДокумента.Объем,
	|	ВТ_ПоказателиДокумента.Направление,
	|	ВТ_ПоказателиДокумента.Показатель,
	|	ВложенныйЗапрос.ВидОтгрузки,
	|	ВложенныйЗапрос.Влажность,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВТ_ПоказателиДокумента.Организация КАК Организация,
	|	ВложенныйЗапрос.Порода,
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.Сорт,
	|	ВложенныйЗапрос.Характеристика,
	|	ВТ_ПоказателиДокумента.Показатель.алк_ОперацияПроизводства КАК Операция,
	|	ИСТИНА КАК Активность,
	|	ВТ_ПоказателиДокумента.Дата КАК Период
	|ИЗ
	|	ВТ_ПоказателиДокумента КАК ВТ_ПоказателиДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			алк_ПоказателиПроизводства.Ссылка КАК Ссылка,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваВидыОтгрузки.ВидОтгрузки) КАК ВидОтгрузки,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваВлажности.Влажность) КАК Влажность,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваНоменклатуры.Номенклатура) КАК Номенклатура,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваПороды.Порода) КАК Порода,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваСклады.Склад) КАК Склад,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваСорта.Сорт) КАК Сорт,
	|			МАКСИМУМ(алк_ПоказателиПроизводстваХарактеристики.Характеристика) КАК Характеристика
	|		ИЗ
	|			Справочник.алк_ПоказателиПроизводства КАК алк_ПоказателиПроизводства
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Сорта КАК алк_ПоказателиПроизводстваСорта
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваСорта.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Породы КАК алк_ПоказателиПроизводстваПороды
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваПороды.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Номенклатуры КАК алк_ПоказателиПроизводстваНоменклатуры
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваНоменклатуры.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.ВидыОтгрузки КАК алк_ПоказателиПроизводстваВидыОтгрузки
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваВидыОтгрузки.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Склады КАК алк_ПоказателиПроизводстваСклады
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваСклады.Ссылка
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПоказателиПроизводства.Характеристики КАК алк_ПоказателиПроизводстваХарактеристики
	|				ПО алк_ПоказателиПроизводства.Ссылка = алк_ПоказателиПроизводстваХарактеристики.Характеристика,
	|			Справочник.алк_ПоказателиПроизводства.Влажности КАК алк_ПоказателиПроизводстваВлажности
	|		ГДЕ
	|			алк_ПоказателиПроизводства.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТ.Показатель
	|					ИЗ
	|						ВТ_ПоказателиДокумента КАК ВТ)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			алк_ПоказателиПроизводства.Ссылка) КАК ВложенныйЗапрос
	|		ПО ВТ_ПоказателиДокумента.Показатель = ВложенныйЗапрос.Ссылка");
	Запрос.УстановитьПараметр("ВводПоказателей", Ссылка);
	ДвиженияПоОборотамПроизводства = Запрос.Выполнить().Выгрузить();
	Для каждого Строка из ПоказателиОперсводки Цикл
		ОборотыПроизводства.Загрузить(ДвиженияПоОборотамПроизводства);
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)   
	
	//добавим операцию в задание
	РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
	ДатаСмены,
	Справочники.алк_ОперацииПроизводства.НайтиПоКоду("000000419"),
	Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);
	//\\
	
КонецПроцедуры
